#!/bin/bash

# Цвета
b=$'\033[34m' # Blue
y=$'\033[33m' # Yellow
r=$'\033[0m'  # Reset
c='\033[0;36m'
v='\033[0;35m'

# Функция подсветки "█" блоков
function print_colored() {
  echo "${b}$(echo "$1" | sed -E "s/(█+)/${b}\1${b}/g")${r}"
}

echo
print_colored "  ███╗   ██╗  ███████╗  ██╗  ██╗  ██╗   ██╗  ███████╗"
print_colored "  ████╗  ██║  ██╔════╝  ╚██╗██╔╝  ██║   ██║  ██╔════╝"
print_colored "  ██╔██╗ ██║  █████╗     ╚███╔╝   ██║   ██║  ███████╗"
print_colored "  ██║╚██╗██║  ██╔══╝     ██╔██╗   ██║   ██║  ╚════██║"
print_colored "  ██║ ╚████║  ███████╗  ██╔╝ ██╗  ╚██████╔╝  ███████║"
print_colored "  ╚═╝  ╚═══╝  ╚══════╝  ╚═╝  ╚═╝   ╚═════╝   ╚══════╝"
echo

